Documents/ВводНачальныхДолговПереплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВводНачальныхДолговПереплат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Долги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бокс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Собственник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Владельцы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Взаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Взаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Владельцы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВводНачальныхДолговПереплат/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для каждого Стр Из Долги Цикл
		Если Стр.Бокс.Пустая() Тогда
			Сообщить("Строка " + Стр.НомерСтроки + ": не указан бокс.");
			Отказ = Истина;
		КонецЕсли;
		Если Стр.Сумма = 0 Тогда
			Сообщить("Строка " + Стр.НомерСтроки + ": нулевая сумма – уберите строку.");
			Отказ =Истина;
		КонецЕсли;
		Если Не Стр.Собственник.Пустая() И Стр.Собственник <> ЭлектроУчет.СобственникБоксаНаДату(Стр.Бокс, Дата) Тогда
			Сообщить("Строка " + Стр.НомерСтроки + ": собственник не соответствует владельцу бокса на дату документа.");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.Взаиморасчеты.Записывать = Истина;
	Для каждого Стр Из Долги Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период = Дата;
		Движение.Бокс = Стр.Бокс;
		Движение.Собственник = ?(Стр.Сумма > 0, ВидДвиженияНакопления.Приход,  //должен
		ВидДвиженияНакопления.Расход);  //переплата (минус на входе)
	    Движение.Сумма = Макс(Стр.Сумма, -Стр.Сумма); // модуль
	КонецЦикла;
КонецПроцедуры
